# ETL - Segunda parte

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
df_1_ETL2 = pd.read_csv('Data\homicidios_2.csv')

In [6]:
df_gcba = pd.read_excel('Data\gcba_pob_comunas_17.xlsx')

In [3]:
print(len(df_1_ETL2))
print(df_1_ETL2.isnull().sum())
print(df_1_ETL2.columns)

df_1_ETL2.head(10)

696
Unnamed: 0               0
ID                       0
N_VICTIMAS               0
FECHA                    0
AAAA                     0
MM                       0
DD                       0
HORA                     0
HH                       0
LUGAR_DEL_HECHO          0
TIPO_DE_CALLE            0
Calle                    0
Cruce                    0
Dirección Normalizada    0
COMUNA                   0
PARTICIPANTES            0
VICTIMA                  0
ACUSADO                  0
dtype: int64
Index(['Unnamed: 0', 'ID', 'N_VICTIMAS', 'FECHA', 'AAAA', 'MM', 'DD', 'HORA',
       'HH', 'LUGAR_DEL_HECHO', 'TIPO_DE_CALLE', 'Calle', 'Cruce',
       'Dirección Normalizada', 'COMUNA', 'PARTICIPANTES', 'VICTIMA',
       'ACUSADO'],
      dtype='object')

,Unnamed: 0,ID,N_VICTIMAS,FECHA,AAAA,MM,DD,HORA,HH,LUGAR_DEL_HECHO,TIPO_DE_CALLE,Calle,Cruce,Dirección Normalizada,COMUNA,PARTICIPANTES,VICTIMA,ACUSADO
0,0,2016-0001,1,2016-01-01,2016,1,1,04:00:00,4,AV PIEDRA BUENA Y AV FERNANDEZ DE LA CRUZ,AVENIDA,PIEDRA BUENA AV.,"FERNANDEZ DE LA CRUZ, F., GRAL. AV.","PIEDRA BUENA AV. y FERNANDEZ DE LA CRUZ, F., G...",8,MOTO-AUTO,MOTO,AUTO
1,1,2016-0002,1,2016-01-02,2016,1,2,01:15:00,1,AV GRAL PAZ Y AV DE LOS CORRALES,GRAL PAZ,"PAZ, GRAL. AV.",DE LOS CORRALES AV.,"PAZ, GRAL. AV. y DE LOS CORRALES AV.",9,AUTO-PASAJEROS,AUTO,PASAJEROS
2,2,2016-0003,1,2016-01-03,2016,1,3,07:00:00,7,AV ENTRE RIOS 2034,AVENIDA,ENTRE RIOS AV.,Sin Cruce,ENTRE RIOS AV. 2034,1,MOTO-AUTO,MOTO,AUTO
3,3,2016-0004,1,2016-01-10,2016,1,10,00:00:00,0,AV LARRAZABAL Y GRAL VILLEGAS CONRADO,AVENIDA,LARRAZABAL AV.,"VILLEGAS, CONRADO, GRAL.","LARRAZABAL AV. y VILLEGAS, CONRADO, GRAL.",8,MOTO-SD,MOTO,SD
4,4,2016-0005,1,2016-01-21,2016,1,21,05:20:00,5,AV SAN JUAN Y PRESIDENTE LUIS SAENZ PEÑA,AVENIDA,SAN JUAN AV.,"SAENZ PE?A, LUIS, PRES.","SAN JUAN AV. y SAENZ PEÃ‘A, LUIS, PRES.",1,MOTO-PASAJEROS,MOTO,PASAJEROS
5,5,2016-0008,1,2016-01-24,2016,1,24,18:30:00,18,AV 27 DE FEBRERO Y AV ESCALADA,AVENIDA,27 DE FEBRERO AV.,ESCALADA AV.,27 DE FEBRERO AV. y ESCALADA AV.,8,MOTO-OBJETO FIJO,MOTO,OBJETO FIJO
6,6,2016-0009,1,2016-01-24,2016,1,24,19:10:00,19,NOGOYA Y JOAQUIN V. GONZALES,CALLE,NOGOYA,"GONZALEZ, JOAQUIN V.","NOGOYA y GONZALEZ, JOAQUIN V.",11,MOTO-AUTO,MOTO,AUTO
7,7,2016-0010,1,2016-01-29,2016,1,29,15:20:00,15,AV GENERAL PAZ Y AV DE LOS CORRALES,GRAL PAZ,"PAZ, GRAL. AV.",DE LOS CORRALES AV.,"PAZ, GRAL. AV. y DE LOS CORRALES AV.",9,MOTO-AUTO,MOTO,AUTO
8,8,2016-0012,1,2016-02-08,2016,2,8,01:20:00,1,AV BELGRANO Y BERNARDO DE IRIGOYEN,AVENIDA,BELGRANO AV.,"IRIGOYEN, BERNARDO DE","BELGRANO AV. e IRIGOYEN, BERNARDO DE",1,MOTO-CARGAS,MOTO,CARGAS
9,9,2016-0013,1,2016-02-10,2016,2,10,11:30:00,11,AV ENTRE RIOS 1366,AVENIDA,ENTRE RIOS AV.,Sin Cruce,ENTRE RIOS AV. 1366,1,PEATON-AUTO,PEATON,AUTO

In [4]:
df_1_ETL2_v2 = df_1_ETL2.copy()

In [5]:
df_1_ETL2_v3 = df_1_ETL2_v2.groupby(['AAAA', 'MM'])['N_VICTIMAS'].sum().reset_index()

In [7]:
print(len(df_1_ETL2_v3))
print(df_1_ETL2_v3.isnull().sum())
print(df_1_ETL2_v3.columns)

df_1_ETL2_v3.head(10)

72
AAAA          0
MM            0
N_VICTIMAS    0
dtype: int64
Index(['AAAA', 'MM', 'N_VICTIMAS'], dtype='object')

   AAAA  MM  N_VICTIMAS
0  2016   1           8
1  2016   2          12
2  2016   3          13
3  2016   4          11
4  2016   5           7
5  2016   6          14
6  2016   7          11
7  2016   8          13
8  2016   9          12
9  2016  10          12

In [12]:
df_1_ETL2_v3_Sem1 = df_1_ETL2_v3[(df_1_ETL2_v3['MM'] >= 1) & (df_1_ETL2_v3['MM'] <= 6)]
df_1_ETL2_v3_Sem2 = df_1_ETL2_v3[(df_1_ETL2_v3['MM'] >= 7) & (df_1_ETL2_v3['MM'] <= 12)]

In [11]:
df_1_ETL2_v3_Sem1.head(6)

   AAAA  MM  N_VICTIMAS
0  2016   1           8
1  2016   2          12
2  2016   3          13
3  2016   4          11
4  2016   5           7
5  2016   6          14

In [13]:
df_1_ETL2_v3_Sem2.head(6)

    AAAA  MM  N_VICTIMAS
6   2016   7          11
7   2016   8          13
8   2016   9          12
9   2016  10          12
10  2016  11          14
11  2016  12          19

In [14]:
df_1_ETL2_v3_Sem1 = df_1_ETL2_v3_Sem1.groupby(['AAAA'])['N_VICTIMAS'].sum().reset_index()

In [16]:
df_1_ETL2_v3_Sem1["Semestre"] = 1

In [17]:
df_1_ETL2_v3_Sem1

   AAAA  N_VICTIMAS  Semestre
0  2016          65         1
1  2017          69         1
2  2018          70         1
3  2019          57         1
4  2020          31         1
5  2021          55         1

In [21]:
df_1_ETL2_v3_Sem2 = df_1_ETL2_v3_Sem2.groupby(['AAAA'])['N_VICTIMAS'].sum().reset_index()

In [22]:
df_1_ETL2_v3_Sem2["Semestre"] = 2

In [23]:
df_1_ETL2_v3_Sem2

   AAAA  N_VICTIMAS  Semestre
0  2016          81         2
1  2017          71         2
2  2018          79         2
3  2019          47         2
4  2020          50         2
5  2021          42         2

In [45]:
df_1_ETL2_v4 = pd.merge(df_1_ETL2_v3_Sem1, df_1_ETL2_v3_Sem2, on='AAAA')

In [46]:
df_1_ETL2_v4

   AAAA  N_VICTIMAS_x  Semestre_x  N_VICTIMAS_y  Semestre_y
0  2016            65           1            81           2
1  2017            69           1            71           2
2  2018            70           1            79           2
3  2019            57           1            47           2
4  2020            31           1            50           2
5  2021            55           1            42           2

-------------------------------------------------------------------

In [25]:
df_gcba

    COMUNA  POBLACION
0        1     253271
1        2     149720
2        3     192763
3        4     238809
4        5     186956
5        6     184846
6        7     240607
7        8     226649
8        9     170605
9       10     170282
10      11     189986
11      12     213914
12      13     235967
13      14     226944
14      15     182409

In [28]:
df_gcba_v2 = df_gcba.copy()

df_gcba_v3 = df_gcba_v2['POBLACION'].sum()

In [29]:
df_gcba_v3

3063728

--------------------------------------

In [47]:
df_1_ETL2_v5 = df_1_ETL2_v4.copy()

In [48]:
df_1_ETL2_v5["Poblacion total"] = df_gcba_v3

In [49]:
df_1_ETL2_v5

   AAAA  N_VICTIMAS_x  Semestre_x  N_VICTIMAS_y  Semestre_y  Poblacion total
0  2016            65           1            81           2          3063728
1  2017            69           1            71           2          3063728
2  2018            70           1            79           2          3063728
3  2019            57           1            47           2          3063728
4  2020            31           1            50           2          3063728
5  2021            55           1            42           2          3063728

In [50]:
df_1_ETL2_v5 = df_1_ETL2_v5.rename(columns={"N_VICTIMAS_x": "VICTIMAS S1", "N_VICTIMAS_y": "VICTIMAS S2"})

In [51]:
df_1_ETL2_v5

   AAAA  VICTIMAS S1  Semestre_x  VICTIMAS S2  Semestre_y  Poblacion total
0  2016           65           1           81           2          3063728
1  2017           69           1           71           2          3063728
2  2018           70           1           79           2          3063728
3  2019           57           1           47           2          3063728
4  2020           31           1           50           2          3063728
5  2021           55           1           42           2          3063728

In [52]:
df_1_ETL2_v5 = df_1_ETL2_v5.drop(['Semestre_x','Semestre_y'], axis=1)

In [53]:
df_1_ETL2_v5

   AAAA  VICTIMAS S1  VICTIMAS S2  Poblacion total
0  2016           65           81          3063728
1  2017           69           71          3063728
2  2018           70           79          3063728
3  2019           57           47          3063728
4  2020           31           50          3063728
5  2021           55           42          3063728

In [117]:
df_1_ETL2_v5['% VICTIMAS S1'] = (((df_1_ETL2_v5['VICTIMAS S1']) / (df_1_ETL2_v5['Poblacion total'])) * 100000).round(2)
df_1_ETL2_v5['% VICTIMAS S2'] = (((df_1_ETL2_v5['VICTIMAS S2']) / (df_1_ETL2_v5['Poblacion total'])) * 100000).round(2)
df_1_ETL2_v5['VICTIMAS TOTAL'] = ((df_1_ETL2_v5['VICTIMAS S1']) + (df_1_ETL2_v5['VICTIMAS S2']))
df_1_ETL2_v5['% VICTIMAS TOTAL'] = ((df_1_ETL2_v5['VICTIMAS S1']) + (df_1_ETL2_v5['VICTIMAS S2']) / (df_1_ETL2_v5['Poblacion total']) * 100000).round(2)

In [118]:
df_1_ETL2_v5

,AAAA,VICTIMAS S1,VICTIMAS S2,Poblacion total,% VICTIMAS S1,% VICTIMAS S2,VICTIMAS TOTAL,% VICTIMAS TOTAL
0,2016,65,81,3063728,2.12,2.64,146,67.64
1,2017,69,71,3063728,2.25,2.32,140,71.32
2,2018,70,79,3063728,2.28,2.58,149,72.58
3,2019,57,47,3063728,1.86,1.53,104,58.53
4,2020,31,50,3063728,1.01,1.63,81,32.63
5,2021,55,42,3063728,1.80,1.37,97,56.37

-------------------------------------------------------------

In [57]:
df_1_ETL2_2_v2 = df_1_ETL2.copy()

In [59]:
df_1_ETL2_2_v2 = df_1_ETL2_2_v2.groupby(['AAAA', 'MM', 'COMUNA'])['N_VICTIMAS'].sum().reset_index()

In [60]:
df_1_ETL2_2_v2

     AAAA  MM  COMUNA  N_VICTIMAS
0    2016   1       1           2
1    2016   1       8           3
2    2016   1       9           2
3    2016   1      11           1
4    2016   2       1           4
..    ...  ..     ...         ...
476  2021  12       7           1
477  2021  12       9           2
478  2021  12      10           1
479  2021  12      11           2
480  2021  12      13           1

[481 rows x 4 columns]

In [98]:
df_1_ETL2_2_v3 = df_1_ETL2_2_v2.copy()

In [99]:
df_1_ETL2_2_v3_Sem1 = df_1_ETL2_2_v3[(df_1_ETL2_2_v3['MM'] >= 1) & (df_1_ETL2_2_v3['MM'] <= 6)]
df_1_ETL2_2_v3_Sem2 = df_1_ETL2_2_v3[(df_1_ETL2_2_v3['MM'] >= 7) & (df_1_ETL2_2_v3['MM'] <= 12)]

In [72]:
df_1_ETL2_2_v3_Sem1['MM'].value_counts()

MM
1    50
5    42
6    41
2    39
3    36
4    34
Name: count, dtype: int64

In [73]:
df_1_ETL2_2_v3_Sem2['MM'].value_counts()

MM
12    48
11    45
8     40
10    36
7     35
9     35
Name: count, dtype: int64

In [100]:
df_1_ETL2_2_v3_Sem1 = df_1_ETL2_2_v3_Sem1.rename(columns={"N_VICTIMAS": "VICTIMAS S1"})
df_1_ETL2_2_v3_Sem2 = df_1_ETL2_2_v3_Sem2.rename(columns={"N_VICTIMAS": "VICTIMAS S2"})

In [101]:
print(len(df_1_ETL2_2_v3_Sem1))
df_1_ETL2_2_v3_Sem1.head()

242

   AAAA  MM  COMUNA  VICTIMAS S1
0  2016   1       1            2
1  2016   1       8            3
2  2016   1       9            2
3  2016   1      11            1
4  2016   2       1            4

In [102]:
print(len(df_1_ETL2_2_v3_Sem2))
df_1_ETL2_2_v3_Sem2.head()

239

    AAAA  MM  COMUNA  VICTIMAS S2
40  2016   7       1            2
41  2016   7       3            1
42  2016   7       5            1
43  2016   7       6            1
44  2016   7       8            1

--------------------------------------------

In [103]:
df_gcba_2_v2 = df_gcba.copy()
df_gcba_2_v2

    COMUNA  POBLACION
0        1     253271
1        2     149720
2        3     192763
3        4     238809
4        5     186956
5        6     184846
6        7     240607
7        8     226649
8        9     170605
9       10     170282
10      11     189986
11      12     213914
12      13     235967
13      14     226944
14      15     182409

In [104]:
df_1_ETL2_2_v4_S1 = pd.merge(df_1_ETL2_2_v3_Sem1, df_gcba_2_v2, on='COMUNA')

df_1_ETL2_2_v4_S2 = pd.merge(df_1_ETL2_2_v3_Sem2, df_gcba_2_v2, on='COMUNA')

In [105]:
print(len(df_1_ETL2_2_v4_S1))
df_1_ETL2_2_v4_S1.head()

242

   AAAA  MM  COMUNA  VICTIMAS S1  POBLACION
0  2016   1       1            2     253271
1  2016   2       1            4     253271
2  2016   3       1            1     253271
3  2016   4       1            1     253271
4  2016   5       1            2     253271

In [106]:
print(len(df_1_ETL2_2_v4_S2))
df_1_ETL2_2_v4_S2.head()

237

   AAAA  MM  COMUNA  VICTIMAS S2  POBLACION
0  2016   7       1            2     253271
1  2016   8       1            2     253271
2  2016   9       1            1     253271
3  2016  10       1            1     253271
4  2016  11       1            2     253271

In [107]:
df_1_ETL2_2_v4_S1['% VICTIMAS S1'] = (((df_1_ETL2_2_v4_S1['VICTIMAS S1']) / (df_1_ETL2_2_v4_S1['POBLACION'])) * 100000).round(2)
df_1_ETL2_2_v4_S2['% VICTIMAS S2'] = (((df_1_ETL2_2_v4_S2['VICTIMAS S2']) / (df_1_ETL2_2_v4_S2['POBLACION'])) * 100000).round(2)

In [111]:
print(len(df_1_ETL2_2_v4_S1))
df_1_ETL2_2_v4_S1.head()

242

   AAAA  MM  COMUNA  VICTIMAS S1  POBLACION  % VICTIMAS S1
0  2016   1       1            2     253271           0.79
1  2016   2       1            4     253271           1.58
2  2016   3       1            1     253271           0.39
3  2016   4       1            1     253271           0.39
4  2016   5       1            2     253271           0.79

In [109]:
print(len(df_1_ETL2_2_v4_S2))
df_1_ETL2_2_v4_S2.head()

237

   AAAA  MM  COMUNA  VICTIMAS S2  POBLACION  % VICTIMAS S2
0  2016   7       1            2     253271           0.79
1  2016   8       1            2     253271           0.79
2  2016   9       1            1     253271           0.39
3  2016  10       1            1     253271           0.39
4  2016  11       1            2     253271           0.79

---------------------------------------------------------------------

In [112]:
df_1_ETL2_3 =  df_1_ETL2.copy()

In [122]:
print(len(df_1_ETL2_3))
df_1_ETL2_3.head()

696

,Unnamed: 0,ID,N_VICTIMAS,FECHA,AAAA,MM,DD,HORA,HH,LUGAR_DEL_HECHO,TIPO_DE_CALLE,Calle,Cruce,Dirección Normalizada,COMUNA,PARTICIPANTES,VICTIMA,ACUSADO
0,0,2016-0001,1,2016-01-01,2016,1,1,04:00:00,4,AV PIEDRA BUENA Y AV FERNANDEZ DE LA CRUZ,AVENIDA,PIEDRA BUENA AV.,"FERNANDEZ DE LA CRUZ, F., GRAL. AV.","PIEDRA BUENA AV. y FERNANDEZ DE LA CRUZ, F., G...",8,MOTO-AUTO,MOTO,AUTO
1,1,2016-0002,1,2016-01-02,2016,1,2,01:15:00,1,AV GRAL PAZ Y AV DE LOS CORRALES,GRAL PAZ,"PAZ, GRAL. AV.",DE LOS CORRALES AV.,"PAZ, GRAL. AV. y DE LOS CORRALES AV.",9,AUTO-PASAJEROS,AUTO,PASAJEROS
2,2,2016-0003,1,2016-01-03,2016,1,3,07:00:00,7,AV ENTRE RIOS 2034,AVENIDA,ENTRE RIOS AV.,Sin Cruce,ENTRE RIOS AV. 2034,1,MOTO-AUTO,MOTO,AUTO
3,3,2016-0004,1,2016-01-10,2016,1,10,00:00:00,0,AV LARRAZABAL Y GRAL VILLEGAS CONRADO,AVENIDA,LARRAZABAL AV.,"VILLEGAS, CONRADO, GRAL.","LARRAZABAL AV. y VILLEGAS, CONRADO, GRAL.",8,MOTO-SD,MOTO,SD
4,4,2016-0005,1,2016-01-21,2016,1,21,05:20:00,5,AV SAN JUAN Y PRESIDENTE LUIS SAENZ PEÑA,AVENIDA,SAN JUAN AV.,"SAENZ PE?A, LUIS, PRES.","SAN JUAN AV. y SAENZ PEÃ‘A, LUIS, PRES.",1,MOTO-PASAJEROS,MOTO,PASAJEROS

In [120]:
df_1_ETL2_3_v2 = df_1_ETL2_3[df_1_ETL2_3["VICTIMA"] == "MOTO"]

In [123]:
print(len(df_1_ETL2_3_v2))
df_1_ETL2_3_v2.head()

295

,Unnamed: 0,ID,N_VICTIMAS,FECHA,AAAA,MM,DD,HORA,HH,LUGAR_DEL_HECHO,TIPO_DE_CALLE,Calle,Cruce,Dirección Normalizada,COMUNA,PARTICIPANTES,VICTIMA,ACUSADO
0,0,2016-0001,1,2016-01-01,2016,1,1,04:00:00,4,AV PIEDRA BUENA Y AV FERNANDEZ DE LA CRUZ,AVENIDA,PIEDRA BUENA AV.,"FERNANDEZ DE LA CRUZ, F., GRAL. AV.","PIEDRA BUENA AV. y FERNANDEZ DE LA CRUZ, F., G...",8,MOTO-AUTO,MOTO,AUTO
2,2,2016-0003,1,2016-01-03,2016,1,3,07:00:00,7,AV ENTRE RIOS 2034,AVENIDA,ENTRE RIOS AV.,Sin Cruce,ENTRE RIOS AV. 2034,1,MOTO-AUTO,MOTO,AUTO
3,3,2016-0004,1,2016-01-10,2016,1,10,00:00:00,0,AV LARRAZABAL Y GRAL VILLEGAS CONRADO,AVENIDA,LARRAZABAL AV.,"VILLEGAS, CONRADO, GRAL.","LARRAZABAL AV. y VILLEGAS, CONRADO, GRAL.",8,MOTO-SD,MOTO,SD
4,4,2016-0005,1,2016-01-21,2016,1,21,05:20:00,5,AV SAN JUAN Y PRESIDENTE LUIS SAENZ PEÑA,AVENIDA,SAN JUAN AV.,"SAENZ PE?A, LUIS, PRES.","SAN JUAN AV. y SAENZ PEÃ‘A, LUIS, PRES.",1,MOTO-PASAJEROS,MOTO,PASAJEROS
5,5,2016-0008,1,2016-01-24,2016,1,24,18:30:00,18,AV 27 DE FEBRERO Y AV ESCALADA,AVENIDA,27 DE FEBRERO AV.,ESCALADA AV.,27 DE FEBRERO AV. y ESCALADA AV.,8,MOTO-OBJETO FIJO,MOTO,OBJETO FIJO

In [124]:
df_1_ETL2_3_v3 = df_1_ETL2_3_v2.groupby(['AAAA'])['N_VICTIMAS'].sum().reset_index()

In [126]:
print(len(df_1_ETL2_3_v3))
df_1_ETL2_3_v3.head(10)

6

   AAAA  N_VICTIMAS
0  2016          65
1  2017          56
2  2018          57
3  2019          50
4  2020          28
5  2021          46

In [127]:
df_1_ETL2_3_v4 = df_1_ETL2_3_v3.copy()

In [140]:
lista_calculo = []

for x in range(5):

    calculo = (((df_1_ETL2_3_v4.iloc[x]['N_VICTIMAS'] - df_1_ETL2_3_v4.iloc[x + 1]['N_VICTIMAS']) / (df_1_ETL2_3_v4.iloc[x]['N_VICTIMAS'])) * 100).round(2)
    
    lista_calculo.append(calculo * -1)

In [169]:
lista_calculo

[-13.85, 1.79, -12.28, -44.0, 64.29]

In [186]:
df_1_ETL2_3_v5 = df_1_ETL2_3_v4.copy()

In [187]:
for x in range(5):
    df_1_ETL2_3_v5.loc[x + 1, 'Variacion'] = lista_calculo[x]

In [189]:
df_1_ETL2_3_v5["Variacion"].replace(to_replace=np.nan, value=0, inplace=True)

In [190]:
df_1_ETL2_3_v5

   AAAA  N_VICTIMAS  Variacion
0  2016          65       0.00
1  2017          56     -13.85
2  2018          57       1.79
3  2019          50     -12.28
4  2020          28     -44.00
5  2021          46      64.29

-------------------------------------

In [192]:
with pd.ExcelWriter('Archivos\data_homicidios.xlsx') as writer:
    
    df_1_ETL2_v5.to_excel(writer, sheet_name='KPI_1', index=False)
    df_1_ETL2_2_v4_S1.to_excel(writer, sheet_name='KPI_1_x_COMUNA_S1', index=False)
    df_1_ETL2_2_v4_S2.to_excel(writer, sheet_name='KPI_1_x_COMUNA_S2', index=False)
    df_1_ETL2_3_v5.to_excel(writer, sheet_name='KPI_2', index=False)

----------------------------------------------------------

In [194]:
df_1_ETL2.head()

,Unnamed: 0,ID,N_VICTIMAS,FECHA,AAAA,MM,DD,HORA,HH,LUGAR_DEL_HECHO,TIPO_DE_CALLE,Calle,Cruce,Dirección Normalizada,COMUNA,PARTICIPANTES,VICTIMA,ACUSADO
0,0,2016-0001,1,2016-01-01,2016,1,1,04:00:00,4,AV PIEDRA BUENA Y AV FERNANDEZ DE LA CRUZ,AVENIDA,PIEDRA BUENA AV.,"FERNANDEZ DE LA CRUZ, F., GRAL. AV.","PIEDRA BUENA AV. y FERNANDEZ DE LA CRUZ, F., G...",8,MOTO-AUTO,MOTO,AUTO
1,1,2016-0002,1,2016-01-02,2016,1,2,01:15:00,1,AV GRAL PAZ Y AV DE LOS CORRALES,GRAL PAZ,"PAZ, GRAL. AV.",DE LOS CORRALES AV.,"PAZ, GRAL. AV. y DE LOS CORRALES AV.",9,AUTO-PASAJEROS,AUTO,PASAJEROS
2,2,2016-0003,1,2016-01-03,2016,1,3,07:00:00,7,AV ENTRE RIOS 2034,AVENIDA,ENTRE RIOS AV.,Sin Cruce,ENTRE RIOS AV. 2034,1,MOTO-AUTO,MOTO,AUTO
3,3,2016-0004,1,2016-01-10,2016,1,10,00:00:00,0,AV LARRAZABAL Y GRAL VILLEGAS CONRADO,AVENIDA,LARRAZABAL AV.,"VILLEGAS, CONRADO, GRAL.","LARRAZABAL AV. y VILLEGAS, CONRADO, GRAL.",8,MOTO-SD,MOTO,SD
4,4,2016-0005,1,2016-01-21,2016,1,21,05:20:00,5,AV SAN JUAN Y PRESIDENTE LUIS SAENZ PEÑA,AVENIDA,SAN JUAN AV.,"SAENZ PE?A, LUIS, PRES.","SAN JUAN AV. y SAENZ PEÃ‘A, LUIS, PRES.",1,MOTO-PASAJEROS,MOTO,PASAJEROS

In [27]:
df_1_ETL2_4_v1 = df_1_ETL2.copy()

In [28]:
df_1_ETL2_4_v1 = df_1_ETL2_4_v1.groupby(['AAAA', 'VICTIMA'])['N_VICTIMAS'].sum().reset_index()

In [29]:
print(len(df_1_ETL2_4_v1))
df_1_ETL2_4_v1.head()

37

   AAAA    VICTIMA  N_VICTIMAS
0  2016       AUTO          18
1  2016  BICICLETA           4
2  2016     CARGAS           3
3  2016       MOTO          65
4  2016      MOVIL           1

In [46]:
df_1_ETL2_4_v2 = df_1_ETL2.copy()

In [47]:
df_1_ETL2_4_v2 = df_1_ETL2_4_v2.groupby(['VICTIMA'])['N_VICTIMAS'].sum().reset_index()

In [48]:
print(len(df_1_ETL2_4_v2))
df_1_ETL2_4_v2.head()

10

     VICTIMA  N_VICTIMAS
0       AUTO          92
1  BICICLETA          29
2     CARGAS           7
3       MOTO         302
4      MOVIL           3

In [30]:
df_1_ETL2_5_v1 = df_1_ETL2.copy()

In [31]:
df_1_ETL2_5_v1 = df_1_ETL2_5_v1.groupby(['AAAA', 'MM'])['N_VICTIMAS'].sum().reset_index()

In [32]:
print(len(df_1_ETL2_5_v1))
df_1_ETL2_5_v1.head()

72

   AAAA  MM  N_VICTIMAS
0  2016   1           8
1  2016   2          12
2  2016   3          13
3  2016   4          11
4  2016   5           7

In [39]:
df_1_ETL2_5_v2 = df_1_ETL2.copy()

In [40]:
df_1_ETL2_5_v2 = df_1_ETL2_5_v2.groupby(['MM'])['N_VICTIMAS'].sum().reset_index()

In [41]:
print(len(df_1_ETL2_5_v2))
df_1_ETL2_5_v2.head()

12

   MM  N_VICTIMAS
0   1          62
1   2          59
2   3          56
3   4          52
4   5          60

In [33]:
df_1_ETL2_6_v1 = df_1_ETL2.copy()

In [34]:
df_1_ETL2_6_v1 = df_1_ETL2_6_v1.groupby(['AAAA', 'DD'])['N_VICTIMAS'].sum().reset_index()

In [35]:
print(len(df_1_ETL2_6_v1))
df_1_ETL2_6_v1.head(5)

180

   AAAA  DD  N_VICTIMAS
0  2016   1           1
1  2016   2           5
2  2016   3           5
3  2016   4           6
4  2016   5           1

In [42]:
df_1_ETL2_6_v2 = df_1_ETL2.copy()

In [44]:
df_1_ETL2_6_v2 = df_1_ETL2_6_v2.groupby(['DD'])['N_VICTIMAS'].sum().reset_index()

In [45]:
print(len(df_1_ETL2_6_v2))
df_1_ETL2_6_v2.head(5)

31

   DD  N_VICTIMAS
0   1          18
1   2          24
2   3          28
3   4          23
4   5          19

In [36]:
df_1_ETL2_7_v1 = df_1_ETL2.copy()

In [37]:
df_1_ETL2_7_v1 = df_1_ETL2_7_v1.groupby(['AAAA', 'Calle'])['N_VICTIMAS'].sum().reset_index()

In [38]:
print(len(df_1_ETL2_7_v1))
df_1_ETL2_7_v1.head(5)

484

   AAAA                       Calle  N_VICTIMAS
0  2016           27 DE FEBRERO AV.           4
1  2016              9 DE JULIO AV.           1
2  2016             ACOSTA, MARIANO           2
3  2016  ALBERDI, JUAN BAUTISTA AV.           4
4  2016        ALCORTA, AMANCIO AV.           3

In [13]:
df_1_ETL2_8_v1 = df_1_ETL2.copy()

In [14]:
df_1_ETL2_8_v1 = df_1_ETL2_8_v1.groupby(['Calle'])['N_VICTIMAS'].sum().reset_index()

In [16]:
print(len(df_1_ETL2_8_v1))
df_1_ETL2_8_v1.head(5)

280

                      Calle  N_VICTIMAS
0  11 DE SEPTIEMBRE DE 1888           1
1   15 DE NOVIEMBRE DE 1889           2
2           24 DE NOVIEMBRE           3
3         27 DE FEBRERO AV.           8
4            9 DE JULIO AV.           5

In [21]:
df_1_ETL2_9_v1 = df_1_ETL2.copy()

In [22]:
df_1_ETL2_9_v1 = df_1_ETL2_9_v1.groupby(['COMUNA'])['N_VICTIMAS'].sum().reset_index()

In [23]:
print(len(df_1_ETL2_9_v1))
df_1_ETL2_9_v1.head(5)

16

   COMUNA  N_VICTIMAS
0       0           2
1       1          93
2       2          25
3       3          46
4       4          79

In [24]:
df_1_ETL2_10_v1 = df_1_ETL2.copy()

In [25]:
df_1_ETL2_10_v1 = df_1_ETL2_10_v1.groupby(['AAAA', 'COMUNA'])['N_VICTIMAS'].sum().reset_index()

In [26]:
print(len(df_1_ETL2_10_v1))
df_1_ETL2_10_v1.head(5)

91

   AAAA  COMUNA  N_VICTIMAS
0  2016       0           2
1  2016       1          22
2  2016       2           1
3  2016       3           8
4  2016       4          16